In [1]:
import pandas as pd
import numpy as np

from numpy.random import randn

In [2]:
np.random.seed(101)

In [3]:
labels = ['a','b','c']
data = [10,20,30]
arr = np.array(data)
d = {'d':10,'e':20,'f':30}

In [4]:
arr

array([10, 20, 30])

In [5]:
print(pd.Series(data = data,index=labels))

a    10
b    20
c    30
dtype: int64

In [6]:
print(pd.Series(d))

d    10
e    20
f    30
dtype: int64

In [7]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [8]:
ser1 = pd.Series(['$67','$87','$21','$90','$400'],['SZ','SA','IN','UK','US'])

In [9]:
ser1

SZ     $67
SA     $87
IN     $21
UK     $90
US    $400
dtype: object

In [10]:
ser1['US']

'$400'

In [11]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [12]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [13]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [14]:
def col(df):
    if df<0:
        color = 'red'
    else:
        color = 'green'
    return 'color : %s' %color

In [15]:
df.style.applymap(col)

In [16]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [17]:
df[['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [18]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [19]:
df.loc[['A','D','E']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [20]:
df.loc[['A','D','E'],['W','Z']]

          W         Z
A  2.706850  0.503826
D  0.188695  0.955057
E  0.190794  0.683509

In [21]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
res = df[df['Y']<0]

In [23]:
res

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [24]:
res['Y']<0

B    True
D    True
Name: Y, dtype: bool

In [25]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [27]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
newind = 'SA US SZ UK IN'.split()

In [29]:
newind

['SA', 'US', 'SZ', 'UK', 'IN']

In [30]:
df['States'] = newind

In [31]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     SA
B  0.651118 -0.319318 -0.848077  0.605965     US
C -2.018168  0.740122  0.528813 -0.589001     SZ
D  0.188695 -0.758872 -0.933237  0.955057     UK
E  0.190794  1.978757  2.605967  0.683509     IN

In [32]:
df.set_index('States')

               W         X         Y         Z
States
SA      2.706850  0.628133  0.907969  0.503826
US      0.651118 -0.319318 -0.848077  0.605965
SZ     -2.018168  0.740122  0.528813 -0.589001
UK      0.188695 -0.758872 -0.933237  0.955057
IN      0.190794  1.978757  2.605967  0.683509

In [33]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     SA
B  0.651118 -0.319318 -0.848077  0.605965     US
C -2.018168  0.740122  0.528813 -0.589001     SZ
D  0.188695 -0.758872 -0.933237  0.955057     UK
E  0.190794  1.978757  2.605967  0.683509     IN

##### Multi-level Index DataFrames

In [34]:
outside = 'G1 G1 G1 G2 G2 G2'.split()
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [35]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [36]:
df1 = pd.DataFrame(data = randn(6,4),index=hier_index, columns='A B C D'.split())

In [37]:
df1

             A         B         C         D
G1 1  0.302665  1.693723 -1.706086 -1.159119
   2 -0.134841  0.390528  0.166905  0.184502
   3  0.807706  0.072960  0.638787  0.329646
G2 1 -0.497104 -0.754070 -0.943406  0.484752
   2 -0.116773  1.901755  0.238127  1.996652
   3 -0.993263  0.196800 -1.136645  0.000366

In [38]:
df1.loc['G1'].loc[[1,2]][['A','B']]

          A         B
1  0.302665  1.693723
2 -0.134841  0.390528

In [39]:
df1.loc['G2'].loc[[2,3]][['B','C']]

          B         C
2  1.901755  0.238127
3  0.196800 -1.136645

In [40]:
df1.xs

<bound method NDFrame.xs of              A         B         C         D
G1 1  0.302665  1.693723 -1.706086 -1.159119
   2 -0.134841  0.390528  0.166905  0.184502
   3  0.807706  0.072960  0.638787  0.329646
G2 1 -0.497104 -0.754070 -0.943406  0.484752
   2 -0.116773  1.901755  0.238127  1.996652
   3 -0.993263  0.196800 -1.136645  0.000366>

In [41]:
df1.xs('G1')

          A         B         C         D
1  0.302665  1.693723 -1.706086 -1.159119
2 -0.134841  0.390528  0.166905  0.184502
3  0.807706  0.072960  0.638787  0.329646

In [42]:
df1

             A         B         C         D
G1 1  0.302665  1.693723 -1.706086 -1.159119
   2 -0.134841  0.390528  0.166905  0.184502
   3  0.807706  0.072960  0.638787  0.329646
G2 1 -0.497104 -0.754070 -0.943406  0.484752
   2 -0.116773  1.901755  0.238127  1.996652
   3 -0.993263  0.196800 -1.136645  0.000366

In [43]:
#df1.xs(1,level=)

##### Missing Data

In [44]:
d = {'A':[1,4,np.nan],'B':[8,np.nan,np.nan],'C':[6,2,3]}

In [45]:
d

{'A': [1, 4, nan], 'B': [8, nan, nan], 'C': [6, 2, 3]}

In [46]:
df2 = pd.DataFrame(d)
df2

     A    B  C
0  1.0  8.0  6
1  4.0  NaN  2
2  NaN  NaN  3

In [47]:
df2.dropna()

     A    B  C
0  1.0  8.0  6

In [48]:
df2

     A    B  C
0  1.0  8.0  6
1  4.0  NaN  2
2  NaN  NaN  3

In [49]:
df2.dropna(axis=0)

     A    B  C
0  1.0  8.0  6

In [50]:
df2.dropna(axis=1)

   C
0  6
1  2
2  3

In [51]:
df2.dropna(axis=0,thresh=2)

     A    B  C
0  1.0  8.0  6
1  4.0  NaN  2

In [52]:
df2.fillna(value=df2.mean(), axis=0)

     A    B  C
0  1.0  8.0  6
1  4.0  8.0  2
2  2.5  8.0  3

In [53]:
df2['B'].fillna(value=df2['A'].mean())

0    8.0
1    2.5
2    2.5
Name: B, dtype: float64

##### Group By

In [54]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [55]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [56]:
df3 = pd.DataFrame(data)

In [57]:
df3

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [58]:
byComp = df3.groupby('Company')

In [59]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [60]:
byComp.median()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [61]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [62]:
byComp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

### Conatenation

In [63]:
df4 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']},
                  index=[0,1,2,3])

In [64]:
df5 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                   'B':['B4','B5','B6','B7'],
                   'C':['C4','C5','C6','C7'],
                   'D':['D4','D5','D6','D7']},
                  index=[4,5,6,7])

In [65]:
df6 = pd.DataFrame({'A':['A8','A9','A10','A11'],
                   'B':['B8','B9','B10','B11'],
                   'C':['C8','C9','C10','C11'],
                   'D':['D8','D9','D10','D11']},
                  index=[8,9,10,11])

In [66]:
pd.concat([df4,df5,df6])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [67]:
pd.concat(objs = [df4,df5,df6], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [68]:
left = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']})

right = pd.DataFrame({'key':['K0','K1','K2','K3'],
                     'C':['C0','C1','C2','C3'],
                     'D':['DO','D1','D2','D3']})

In [69]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [70]:
right

  key   C   D
0  K0  C0  DO
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

### Merging

In [71]:
pd.merge(left,right,how='inner',on=['key'])

  key   A   B   C   D
0  K0  A0  B0  C0  DO
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [72]:
pd.merge(left,right,how='outer',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  DO
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [73]:
#pd.merge(left,right,how='cross',on='key')

### Join

In [74]:
left1 = pd.DataFrame({'A':['A0','A1','A2'],
                     'B':['B0','B1','B2'],},
                    index=['K0','K1','K2'])

right1 = pd.DataFrame({'C':['C0','C2','C3'],
                      'D':['D0','D2','D3'],},
                     index=['K0','K2','K3'])

In [75]:
left1.join(right1)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [76]:
left1.join(right1,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [77]:
left1.join(right1,how='inner')

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

### Operations

In [78]:
df7 = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})

In [79]:
df7

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [80]:
#Unique values 
print(df7['col2'].unique())

print(len(df7['col2'].unique()))
print(df7['col2'].nunique())
print(df7['col2'].value_counts())

[444 555 666]
3
3
444    2
555    1
666    1
Name: col2, dtype: int64

### Apply Method

In [81]:
def times3(x):
    return x * 3;

In [82]:
df7['col1'].apply(times3)

0     3
1     6
2     9
3    12
Name: col1, dtype: int64

In [83]:
df7['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [84]:
pwd

'/Users/mlondi/Documents/projects/pythonUdemy'

In [85]:
df8 = pd.read_csv('myOutput.csv')

In [86]:
df8

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [87]:
df8.to_csv('myInput.csv',index=False)

In [88]:
pd.read_csv('myInput.csv')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [89]:
df9 = pd.read_excel('Excel_Sample.xlsx')

In [90]:
df8

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [91]:
from sqlalchemy import create_engine

In [92]:
engine = create_engine('sqlite:///:memory:')

In [93]:
df8.to_sql('my_table',con = engine, index=False)

4

In [94]:
sqldf = pd.read_sql('my_table',con=engine)

In [95]:
sqldf

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15